In [1]:
import pandas as pd
data1 = ['a', 'b', 'c']
labels = [1, 4, 5]
# d = pd.Series(data=labels, index=data1)
d = pd.Series(labels, data1)
d

a    1
b    4
c    5
dtype: int64

In [10]:
d1 = {"ayush": 1, "ayus": 2, "ayu": 39}
d2 = {"ayush": 5, "ayus": 56, "ayu": 10}
n1 = pd.Series(d1)
n2 = pd.Series(d2)
n1%n2

ayush    1
ayus     2
ayu      9
dtype: int64

In [1]:
import numpy as np
from numpy.random import randn
import pandas as pd
np.random.seed(101)
df = pd.DataFrame(randn(5, 4), ['A', 'B', 'C', 'D', 'E'], ['W', 'X', 'Y', 'Z'])
df['X']
df[['W', 'Y']]
df["new_col"] = df['X']+df['Z']
df

          W         X         Y         Z   new_col
A  2.706850  0.628133  0.907969  0.503826  1.131958
B  0.651118 -0.319318 -0.848077  0.605965  0.286647
C -2.018168  0.740122  0.528813 -0.589001  0.151122
D  0.188695 -0.758872 -0.933237  0.955057  0.196184
E  0.190794  1.978757  2.605967  0.683509  2.662266

In [21]:
df.drop('A')
df.drop('W', axis=1)
print(df.loc[['D', 'A']])
df.iloc[3]

          W         X         Y         Z   new_col
D  0.188695 -0.758872 -0.933237  0.955057  0.196184
A  2.706850  0.628133  0.907969  0.503826  1.131958

W          0.188695
X         -0.758872
Y         -0.933237
Z          0.955057
new_col    0.196184
Name: D, dtype: float64

In [26]:
df.loc[['B', 'E'], ['X', 'new_col']]
# df > 0
df[df > 0]

          W         X         Y         Z   new_col
A  2.706850  0.628133  0.907969  0.503826  1.131958
B  0.651118       NaN       NaN  0.605965  0.286647
C       NaN  0.740122  0.528813       NaN  0.151122
D  0.188695       NaN       NaN  0.955057  0.196184
E  0.190794  1.978757  2.605967  0.683509  2.662266

In [11]:
# df['X'] > 0
df[df['X'] > 0]['Z']
df[(df['X'] > 0) & (df['Z'] > 0)]
df[(df['X'] > 0) | (df['Y'] > 0)]

          W         X         Y         Z new_col
A  2.706850  0.628133  0.907969  0.503826      A1
C -2.018168  0.740122  0.528813 -0.589001      C1
E  0.190794  1.978757  2.605967  0.683509      E1

In [12]:
df1 = df.reset_index()
df1['index']
newind = 'A1 B1 C1 D1 E1'.split()
df["new_col"] = newind
df

          W         X         Y         Z new_col
A  2.706850  0.628133  0.907969  0.503826      A1
B  0.651118 -0.319318 -0.848077  0.605965      B1
C -2.018168  0.740122  0.528813 -0.589001      C1
D  0.188695 -0.758872 -0.933237  0.955057      D1
E  0.190794  1.978757  2.605967  0.683509      E1

In [15]:
df.set_index("new_col")

                W         X         Y         Z
new_col
A1       2.706850  0.628133  0.907969  0.503826
B1       0.651118 -0.319318 -0.848077  0.605965
C1      -2.018168  0.740122  0.528813 -0.589001
D1       0.188695 -0.758872 -0.933237  0.955057
E1       0.190794  1.978757  2.605967  0.683509

In [44]:
outside = ['G1', 'G1', 'G1', 'G2', 'G2', 'G2']
inside = [1, 2, 3, 1, 2, 3]
hier_index = list(zip(outside, inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)
print(hier_index)

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [47]:
df2 = pd.DataFrame(randn(6, 2), hier_index, ['A', 'B'])
df2['A']
df2.loc['G1']
print(df2.loc['G1'].loc[2]['A'])
df2

-1.1338171615837889

             A         B
G1 1 -0.925874  1.862864
   2 -1.133817  0.610478
   3  0.386030  2.084019
G2 1 -0.376519  0.230336
   2  0.681209  1.035125
   3 -0.031160  1.939932

In [7]:
df2.index.names = ["Groups", "Name"]
df2
# df2.loc['G1'].loc[3]['A']

                    A         B
Groups Name
G1     1    -0.497104 -0.754070
       2    -0.943406  0.484752
       3    -0.116773  1.901755
G2     1     0.238127  1.996652
       2    -0.993263  0.196800
       3    -1.136645  0.000366

In [8]:
df2.xs(2, level="Name")

               A         B
Groups
G1     -0.943406  0.484752
G2     -0.993263  0.196800

In [9]:
dic = {'A': [1, 4, 6], 'B': [2, np.nan, 4], 'C': [3, 5, 9]}
df3 = pd.DataFrame(dic)
df3

   A    B  C
0  1  2.0  3
1  4  NaN  5
2  6  4.0  9

In [14]:
# df3.dropna()
# df3.dropna(axis=1)
# df3.dropna(thresh=1)
df3.fillna("FILL")

   A     B  C
0  1   2.0  3
1  4  FILL  5
2  6   4.0  9

In [20]:
df3['B'].fillna(df3['A'].mean())

0    2.000000
1    3.666667
2    4.000000
Name: B, dtype: float64

In [10]:
data = {'Company': ['GOOG', 'GOOG', 'MSFT', 'MSFT', 'MSFT', 'FB', 'FB'],
        'Person': ['Sam', 'Charlie', 'Amy', 'Ayush', 'Vanessa', 'Carl', 'Sarah'],
        'Sales': [200, 120, 340, 500, 124, 243, 350]}
df4 = pd.DataFrame(data)
df4

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT    Ayush    500
4    MSFT  Vanessa    124
5      FB     Carl    243
6      FB    Sarah    350

In [48]:
df4.iloc(1)[:1]
# df4.groupby("Company").sum()
df4.groupby("Company").mean().loc["GOOG"]
# df4.groupby('Company').max()

C:\Users\ayush\AppData\Local\Temp\ipykernel_14200\1382378068.py:3: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df4.groupby("Company").mean().loc["GOOG"]

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    500

In [59]:
print(df4.groupby("Company").describe())
df4.groupby("Company").describe().iloc[1]

        Sales
        count        mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.500000   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.000000   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      3.0  321.333333  188.693755  124.0  232.00  340.0  420.00  500.0

Sales  count      2.000000
       mean     160.000000
       std       56.568542
       min      120.000000
       25%      140.000000
       50%      160.000000
       75%      180.000000
       max      200.000000
Name: GOOG, dtype: float64

In [63]:
dic1 = {'A': ['A0', 'A1', 'A2'], 'B': ['B0', 'B1', 'B2']}
dic2 = {'A': ['A3', 'A4', 'A5'], 'B': ['B3', 'B4', 'B5']}
df1_1 = pd.DataFrame(dic1)
df1_2 = pd.DataFrame(dic2, index=[3, 4, 5])
print(df1_1)
print(df1_2)
pd.concat([df1_1, df1_2])

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
    A   B
3  A3  B3
4  A4  B4
5  A5  B5

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3
4  A4  B4
5  A5  B5

In [64]:
pd.concat([df1_1, df1_2], axis=1)

     A    B    A    B
0   A0   B0  NaN  NaN
1   A1   B1  NaN  NaN
2   A2   B2  NaN  NaN
3  NaN  NaN   A3   B3
4  NaN  NaN   A4   B4
5  NaN  NaN   A5   B5

In [13]:
dic3 = {'A': ['A0', 'A1', 'A2'], 'B': ['B0', 'B1', 'B2'], "key": [3, 4, 7]}
dic4 = {'C': ['C0', 'C1', 'C2'], 'D': ['D0', 'D1', 'D2'], "key": [3, 5, 7]}
df1_3 = pd.DataFrame(dic3,index=dic3['key'])
df1_4 = pd.DataFrame(dic4,index=dic4['key'])
print(df1_3)
print(df1_4)
# pd.merge(df1_3, df1_4, how="inner", on="key")
# df1_3.join(df1_4)

    A   B  key
3  A0  B0    3
4  A1  B1    4
7  A2  B2    7
    C   D  key
3  C0  D0    3
5  C1  D1    5
7  C2  D2    7

In [2]:
d = {"col1": [0, 1, 2, 3], "col2": [444, 555, 666, 444],
     "col3": ["abc", "def", "ghi", "xyz"]}
df5 = pd.DataFrame(d, index=[3, 4, 6, 8])
df5

   col1  col2 col3
3     0   444  abc
4     1   555  def
6     2   666  ghi
8     3   444  xyz

In [3]:
# df5["col2"].unique()
# df5["col2"].nunique()
df5["col2"].value_counts()
df5[(df5["col1"] > 1) | (df5["col1"] == 0)]
df5["col2"].apply(lambda x: x%2 == 0)
df5.columns
df5.index

Int64Index([3, 4, 6, 8], dtype='int64')

In [3]:
df5.sort_values(ascending=False, by="col2")
# df5.isnull()

   col1  col2 col3
6     2   666  ghi
4     1   555  def
3     0   444  abc
8     3   444  xyz

In [6]:
df6 = pd.read_csv("Stationary.csv")
df6

       Item Price Description
0    Pencil   ₹ 5  Stationary
1    Eraser   ₹ 5  Stationary
2  Notebook  ₹ 30  Stationary
3     Ruler  ₹ 10  Stationary

In [7]:
new = "Write Erase Write Measure".split()
df6["Use"] = new
df6

       Item Price Description      Use
0    Pencil   ₹ 5  Stationary    Write
1    Eraser   ₹ 5  Stationary    Erase
2  Notebook  ₹ 30  Stationary    Write
3     Ruler  ₹ 10  Stationary  Measure

In [8]:
# df6.to_csv("new_file.csv", index=False)
pd.read_excel("Book1.xlsx", sheet_name="Sheet1")
df6.to_excel("Stationary1.xlsx", sheet_name="My_sheet")

In [23]:
data = pd.read_html(
    "file:///C:/Users/ayush/OneDrive/Documents/Codes/WebDev/html/table.html")
data
# data2 = pd.read_html(
#     "file:///C:/Users/ayush/OneDrive/Documents/Codes/WebDev/html/1.HTML")
# data2

[     Name       Roll Grade
      Name       Roll    Ex   A   B   C   D
 0   Ayush  422MA2034    Ex NaN NaN NaN NaN
 1  Mayank  422MA2174     D NaN NaN NaN NaN]